artillery_test/cluster.txt
Phase started: unnamed (index: 0, duration: 1s) 16:49:21(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 16:49:22(-0300)

--------------------------------------
Metrics for period to: 16:49:30(-0300) (width: 8.664s)
--------------------------------------

http.codes.200: ................................................................ 1439   
http.request_rate: ............................................................. 172/sec
http.requests: ................................................................. 1481   
http.response_time:
  min: ......................................................................... 49     
  max: ......................................................................... 641
  median: ...................................................................... 290.1
  p95: ......................................................................... 376.2
  p99: ......................................................................... 432.7
http.responses: ................................................................ 1439
vusers.completed: .............................................................. 8
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 7900.8
  max: ......................................................................... 8079.6
  median: ...................................................................... 8024.5
  p95: ......................................................................... 8024.5
  p99: ......................................................................... 8024.5


--------------------------------------
Metrics for period to: 16:49:40(-0300) (width: 3.528s)
--------------------------------------

http.codes.200: ................................................................ 561
http.request_rate: ............................................................. 149/sec
http.requests: ................................................................. 519
http.response_time:
  min: ......................................................................... 32
  max: ......................................................................... 397
  median: ...................................................................... 237.5
  p95: ......................................................................... 340.4
  p99: ......................................................................... 368.8
http.responses: ................................................................ 561
vusers.completed: .............................................................. 42
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 7850.3
  max: ......................................................................... 11500.6
  median: ...................................................................... 11274.1
  p95: ......................................................................... 11501.8
  p99: ......................................................................... 11501.8


All VUs finished. Total time: 18 seconds

--------------------------------
Summary report @ 16:49:34(-0300)
--------------------------------

http.codes.200: ................................................................ 2000
http.request_rate: ............................................................. 161/sec
http.requests: ................................................................. 2000
http.response_time:
  min: ......................................................................... 32
  max: ......................................................................... 641
  median: ...................................................................... 267.8
  p95: ......................................................................... 368.8
  p99: ......................................................................... 424.2
http.responses: ................................................................ 2000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 7850.3
  max: ......................................................................... 11500.6
  median: ...................................................................... 11050.8
  p95: ......................................................................... 11501.8
  p99: ......................................................................... 11501.8