artillery_test/fork.txt
Phase started: unnamed (index: 0, duration: 1s) 16:52:11(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 16:52:12(-0300)

--------------------------------------
Metrics for period to: 16:52:20(-0300) (width: 8.284s)
--------------------------------------

http.codes.200: ................................................................ 437
http.request_rate: ............................................................. 59/sec
http.requests: ................................................................. 487
http.response_time:
  min: ......................................................................... 49
  max: ......................................................................... 1495
  median: ...................................................................... 837.3
  p95: ......................................................................... 1465.9
  p99: ......................................................................... 1495.5
http.responses: ................................................................ 437
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50


--------------------------------------
Metrics for period to: 16:52:30(-0300) (width: 9.982s)
--------------------------------------

http.codes.200: ................................................................ 617
http.request_rate: ............................................................. 62/sec
http.requests: ................................................................. 617
http.response_time:
  min: ......................................................................... 762
  max: ......................................................................... 876
  median: ...................................................................... 804.5
  p95: ......................................................................... 837.3
  p99: ......................................................................... 837.3
http.responses: ................................................................ 617


--------------------------------------
Metrics for period to: 16:52:40(-0300) (width: 9.994s)
--------------------------------------

http.codes.200: ................................................................ 604
http.request_rate: ............................................................. 60/sec
http.requests: ................................................................. 603
http.response_time:
  min: ......................................................................... 762
  max: ......................................................................... 898
  median: ...................................................................... 804.5
  p95: ......................................................................... 889.1
  p99: ......................................................................... 889.1
http.responses: ................................................................ 604


--------------------------------------
Metrics for period to: 16:52:50(-0300) (width: 5.691s)
--------------------------------------

http.codes.200: ................................................................ 342
http.request_rate: ............................................................. 55/sec
http.requests: ................................................................. 293
http.response_time:
  min: ......................................................................... 390
  max: ......................................................................... 907
  median: ...................................................................... 804.5
  p95: ......................................................................... 889.1
  p99: ......................................................................... 907
http.responses: ................................................................ 342
vusers.completed: .............................................................. 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 31117.7
  max: ......................................................................... 33062.6
  median: ...................................................................... 33199.7
  p95: ......................................................................... 33199.7
  p99: ......................................................................... 33199.7


All VUs finished. Total time: 37 seconds

--------------------------------
Summary report @ 16:52:45(-0300)
--------------------------------

http.codes.200: ................................................................ 2000
http.request_rate: ............................................................. 59/sec
http.requests: ................................................................. 2000
http.response_time:
  min: ......................................................................... 49
  max: ......................................................................... 1495
  median: ...................................................................... 820.7
  p95: ......................................................................... 889.1
  p99: ......................................................................... 1465.9
http.responses: ................................................................ 2000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 31117.7
  max: ......................................................................... 33062.6
  median: ...................................................................... 33199.7
  p95: ......................................................................... 33199.7
  p99: ......................................................................... 33199.7